turbq/atprog/packs/atmel/SAML22_DFP/1.2.77/Atmel.SAML22_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         xmlns:saxon="http://saxon.sf.net//"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Atmel</vendor>
   <url>http://packs.download.atmel.com/</url>
   <name>SAML22_DFP</name>
   <description>Atmel SAML22 Series Device Support</description>
   <releases>
      <release version="1.2.77" date="2018-08-31">Updated DAC DACCTRL bit names. Represented DSU ENTRY as explicit registers. New representation of alternate registers in ATDF.</release>
      <release version="1.1.62">Removed warnings for some component headers.</release>
      <release version="1.1.57">Files now under Apache license. Fixed GNU/IAR assembler issues.</release>
      <release version="1.0.14">Initial release.</release>
   </releases>
   <keywords>
      <keyword>Atmel</keyword>
      <keyword>Device Family Package Atmel</keyword>
      <keyword>Device Support</keyword>
      <keyword>SAML22</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAML22" Dvendor="Atmel:3">
         <device Dname="ATSAML22J16A">
            <processor Dcore="Cortex-M0+"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/sam.h" define="__SAML22J16A__"/>
            <debug svd="svd/ATSAML22J16A.svd"/>
            <memory id="IROM1"
                    start="0x00000000"
                    size="0x10000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x800"/>
            <memory id="IRAM1" start="0x20000000" size="0x2000" default="1"/>
            <algorithm name="keil/flashloader/Flash/ATSAML22_64.FLM"
                       start="0x00000000"
                       size="0x10000"
                       default="1"/>
            <algorithm name="keil/flashloader/Flash/ATSAML22_64_EEPROM.FLM"
                       start="0x00400000"
                       size="0x00800"
                       default="1"/>
            <algorithm name="keil/flashloader/Flash/FlashOS.h"/>
            <algorithm name="keil/flashloader/Flash/ATSAML22/ATSAML22.uvgui"/>
            <algorithm name="keil/flashloader/Flash/ATSAML22/ATSAML22.uvopt"/>
            <algorithm name="keil/flashloader/Flash/ATSAML22/ATSAML22.uvproj"/>
            <algorithm name="keil/flashloader/Flash/ATSAML22/FlashDev.c"/>
            <algorithm name="keil/flashloader/Flash/ATSAML22/FlashPrg.c"/>
            <algorithm name="keil/flashloader/Flash/ATSAML22/Target.lin"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATSAML22J16A.atdf"/>
                  <at:variant ordercode="SAML22J16A-MU"
                              vccmin="1.62"
                              vccmax="3.63"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="SAML22J16A-MN"
                              vccmin="1.62"
                              vccmax="3.63"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="SAML22J16A-AU"
                              vccmin="1.62"
                              vccmax="3.63"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="SAML22J16A-AN"
                              vccmin="1.62"
                              vccmax="3.63"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:memory name="FLASH"
                             start="0x00000000"
                             size="0x10000"
                             type="flash"
                             pagesize="64"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="CAL"
                             start="0x00800000"
                             size="0x8"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="LOCKBIT"
                             start="0x00802000"
                             size="0x4"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="AUX0"
                             start="0x00804000"
                             size="0x100"
                             type="user_page"
                             pagesize="64"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="AUX1"
                             start="0x00806000"
                             size="0x100"
                             type="fuses"
                             pagesize="64"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="RWW"
                             start="0x00400000"
                             size="0x800"
                             type="flash"
                             pagesize="64"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="HSRAM"
                             start="0x20000000"
                             size="0x2000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="HPB0"
                             start="0x40000000"
                             size="0x4000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HPB1"
                             start="0x41000000"
                             size="0x10000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HPB2"
                             start="0x42000000"
                             size="0x6000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PPB"
                             start="0xE0000000"
                             size="0x100000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SCS"
                             start="0xE000E000"
                             size="0x00001000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 64KB Flash, 8KB SRAM, 32 MHz, four 16-bit timer/counters, DMA, four SERCOMs, USB Device, 16-channel 12-bit ADC, up to 184 LCD segments, 64 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAML22J16A"
                  title="Device page for ATSAML22J16A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAML22J16A"
                  title="Datasheet"/>
         </device>
